# Atividade 2
---
## Primeira etapa
### criação de dataframe

In [29]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'nome': ['Ana', 'Bruno', 'Carlos'],
    'idade': [23, 25, 22],
    'nota': [8.5, 7.0, 9.2]
})
df
#print('tipo:', type(df))

     nome  idade  nota
0     Ana     23   8.5
1   Bruno     25   7.0
2  Carlos     22   9.2

---

## Tarefa 1
### Exibição de nome e nota de alunos

In [30]:
for index, row in df.iterrows():
    print(index, row["nome"], row["nota"])

0 Ana 8.5
1 Bruno 7.0
2 Carlos 9.2

### Cálculo da média

In [31]:
total = 0
count = 0
for row in df.itertuples():
    total += row.nota
    count += 1

print("Média:", total/count)

Média: 8.233333333333333

### Impressão coluna de idades

In [32]:
for index in df.index:
    print(index, df.loc[index, 'idade'])

0 23
1 25
2 22

### Extra:

In [ ]:
df2 = df.copy()

for index in df.index:
    df2.loc[index, 'mensagem'] = f"Aluno {df.loc[index, 'nome']} tirou {df.loc[index, 'nota']}"
df2

     nome  idade  nota                mensagem
0     Ana     23   8.5     Aluno Ana tirou 8.5
1   Bruno     25   7.0   Aluno Bruno tirou 7.0
2  Carlos     22   9.2  Aluno Carlos tirou 9.2

---
## Tarefa 2

In [49]:
df = pd.DataFrame({
    'aluno': ['Ana', 'Bruno', 'Carlos', 'Daniela', 'Eduardo'],
    'turma': ['A', 'B', 'A', 'B', 'A'],
    'nota': [8.5, 7.0, 9.2, 6.5, 8.0]
})
df

     aluno turma  nota
0      Ana     A   8.5
1    Bruno     B   7.0
2   Carlos     A   9.2
3  Daniela     B   6.5
4  Eduardo     A   8.0

In [70]:
print(df.groupby(['turma']).mean(numeric_only=True))

           nota
turma
A      8.566667
B      6.750000

In [71]:
print(df.value_counts(['turma']))

turma
A        3
B        2
Name: count, dtype: int64

In [72]:
print(df.groupby(['turma']).max())

         aluno  nota
turma
A      Eduardo   9.2
B      Daniela   7.0

In [77]:
def verify_approval(x: float):
    if x >= 7:
        return "Aprovado"
    else:
        return "Reprovado"
    
df3 = df.copy()

df3['status'] = df['nota'].apply(verify_approval)
df3

     aluno turma  nota     status
0      Ana     A   8.5   Aprovado
1    Bruno     B   7.0   Aprovado
2   Carlos     A   9.2   Aprovado
3  Daniela     B   6.5  Reprovado
4  Eduardo     A   8.0   Aprovado

---

## Tarefa 3

In [80]:
df = pd.DataFrame({
    'nome': ['Ana', 'Bruno', None, 'Carlos'],
    'idade': [23, None, 22, None],
    'nota': [8.5, 7.0, None, 9.2]
})
df

     nome  idade  nota
0     Ana   23.0   8.5
1   Bruno    NaN   7.0
2    None   22.0   NaN
3  Carlos    NaN   9.2

### Removendo linhas com valores ausentes

In [ ]:

df.dropna(axis = 0, how = 'any') #pra tornar permanente usar inplace = True

  nome  idade  nota
0  Ana   23.0   8.5

### Preenchendo nulos com 0

In [87]:
df.fillna(0)

     nome  idade  nota
0     Ana   23.0   8.5
1   Bruno    0.0   7.0
2       0   22.0   0.0
3  Carlos    0.0   9.2

In [90]:
df.dropna(axis = 1, how = 'all')

     nome  idade  nota
0     Ana   23.0   8.5
1   Bruno    NaN   7.0
2    None   22.0   NaN
3  Carlos    NaN   9.2

In [92]:
alunos = pd.DataFrame({
    'id': [1, 2, 3],
    'nome': ['Ana', 'Bruno', 'Carlos']
})

notas = pd.DataFrame({
    'id': [1, 2, 4],
    'nota': [8.5, 7.0, 9.0]
})

alunos, notas

(   id    nome
 0   1     Ana
 1   2   Bruno
 2   3  Carlos,
    id  nota
 0   1   8.5
 1   2   7.0
 2   4   9.0)

In [99]:
print('inner')
print(pd.merge(alunos, notas, on = 'id', how = 'inner')) # inner join
print('left')
print(pd.merge(alunos, notas, on = 'id', how = 'left')) # left join
print('right')
print(pd.merge(alunos, notas, on = 'id', how = 'right')) # right join
print('outer')
df5 = pd.merge(alunos, notas, on = 'id', how = 'outer')# outer join

inner
   id   nome  nota
0   1    Ana   8.5
1   2  Bruno   7.0
left
   id    nome  nota
0   1     Ana   8.5
1   2   Bruno   7.0
2   3  Carlos   NaN
right
   id   nome  nota
0   1    Ana   8.5
1   2  Bruno   7.0
2   4    NaN   9.0
outer

In [105]:
df5['nota'] = df5['nota'].fillna(df5['nota'].mean())
df5

   id    nome      nota
0   1     Ana  8.500000
1   2   Bruno  7.000000
2   3  Carlos  8.166667
3   4     NaN  9.000000